Linux/LinuxOS/Ubuntu下配置GAE翻墙.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+include "../../template.org"
#+title: Ubunt下配置GAE（Google App Engine）翻墙
* 写在前面
  用GAE半年了，一直以为自己在用5个ID，每天有5G流量，直到昨天在Youtube上看Google IO（两个小时）突然不能用了，登陆https://appengine.google.com 查看后才知道自己一直只用了一个号，只有1G，所以很快用完了。不想再等一天（1天1G，1天过后流量会恢复），想重新配置但由于上传需要翻墙而我的流量又用完了（我第一次配置用的是教育网IPv6，现在没有了），所以没有办法，先在51vpn上注册，临时使用了它的免费vpn后才上传成功。
  中间遇到的问题有下面讲的：Broken pipe
* 配置过程
** 申请google app engine
   网上搜索申请教程即可 例如这篇：http://www.5ishare.com/snews/354700.shtml
** Ubuntu下配置GAE
  * 确保系统装有Python 版本为2.x而非3.x版本
  * 下载goagent：http://code.google.com/p/goagent/ （简易教程中有下载地址）
  * 下载SwitchyOption.bak: https://code.google.com/p/goagent/downloads/list (Chrome代理需要)
  * 修改local/proxy.ini中appid为你申请的id，最多可以申请10个，可以申请多个，一个一天限量1G，足够用了，例如我申请两个visayafan，visayafan1
  * 命令行下$python server/uploader.zip，依次输入visayafan，email和password(是Application密码，而非邮箱密码，如果没有，申请：https://www.google.com/accounts/IssuedAuthSubTokens， 用邮箱密码登陆后会给你的手机发送verify code短信，接着generator一个)，需要输入两次。成功后接着输入第2个ID：visayafan1，依此类推。
    如果这里出现问题，类似：
#+begin_example
server$ python uploader.zip 
APPID:visayafan
Application: visayafan
Host: appengine.google.com
INFO - - [Sep  8 08:32:21] Server: appengine.google.com
Rolling back the update.
Email: visayafan@gmail.com
Password for visayafan@gmail.com: 
Traceback (most recent call last):
  File "/usr/lib/python2.7/runpy.py", line 162, in _run_module_as_main
    "__main__", fname, loader, pkg_name)
  File "/usr/lib/python2.7/runpy.py", line 72, in _run_code
    exec code in run_globals
  File "uploader.zip/__main__.py", line 10, in <module>
  File "uploader.zip/__main__.py", line 6, in main
  File "uploader.zip/appcfg.py", line 206, in main
  File "uploader.zip/appcfg.py", line 197, in upload
  File "uploader.zip/google/appengine/tools/appcfg.py", line 3873, in main
  File "uploader.zip/google/appengine/tools/appcfg.py", line 2443, in Run
  File "uploader.zip/google/appengine/tools/appcfg.py", line 3638, in __call__
  File "uploader.zip/google/appengine/tools/appcfg.py", line 3141, in Rollback
  File "uploader.zip/google/appengine/tools/appcfg.py", line 3158, in _Rollback
  File "uploader.zip/google/appengine/tools/appcfg.py", line 2018, in Rollback
  File "uploader.zip/google/appengine/tools/appcfg.py", line 1698, in Send
  File "uploader.zip/google/appengine/tools/appengine_rpc.py", line 378, in Send
  File "uploader.zip/google/appengine/tools/appengine_rpc.py", line 436, in _Authenticate
  File "uploader.zip/google/appengine/tools/appengine_rpc.py", line 280, in _Authenticate
  File "uploader.zip/google/appengine/tools/appengine_rpc.py", line 219, in _GetAuthToken
  File "/usr/lib/python2.7/urllib2.py", line 391, in open
    response = self._open(req, data)
  File "/usr/lib/python2.7/urllib2.py", line 409, in _open
    '_open', req)
  File "/usr/lib/python2.7/urllib2.py", line 369, in _call_chain
    result = func(*args)
  File "/usr/lib/python2.7/urllib2.py", line 1193, in https_open
    return self.do_open(httplib.HTTPSConnection, req)
  File "uploader.zip/fancy_urllib/__init__.py", line 367, in do_open
    
urllib2.URLError: <urlopen error [Errno 32] Broken pipe>
#+end_example
  解决办法：
#+begin_example
  1. Unzip uploader.zip
     $ unzip uploader.zip
  2. Edit appcfg.py, comment out this line from
     fancy_urllib._create_connection = socket_create_connection
     to
     #fancy_urllib._create_connection = socket_create_connection
  3. Run
     $ (export uploaddir=python; python __main__.py )
#+end_example
  * Chrome安装插件 Proxy SwitchySharp，插件的options->improt/export->restore from file选中下载的SwitchyOption.bak
  * 切换Proxy SwitchySharp为Auto Switch Mode
  * 终端运行命令：$python local/proxy.sh
  * 配置成功
  * 访问twitter和G+的时候遇到证书不信任问题：
#+begin_example
$certutil -d sql:$HOME/.pki/nssdb -A -t "C,," -n GoAgent -i ~/goagent/local/CA.crt
#+end_example
    
#+BEGIN_HTML
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
#+END_HTML
